getting_data.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Getting Eurostat data on health and mortality</title>
<meta name="author" content="Jan Boone@@latex:\thanks{Tilburg University, Department of Economics, Tilec and CEPR, E-mail: \textit{j.boone@uvt.nl}.}@@" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="./latex-css/style.css">
<link rel="stylesheet" href="https://latex.now.sh/prism/prism.css">


</head>
<body>
<div id="content" class="content">
<h1 class="title">Getting Eurostat data on health and mortality</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3fd2bdd">1. Introduction</a></li>
<li><a href="#org54177cd">2. Preamble code</a></li>
<li><a href="#org002c634">3. Combining data</a>
<ul>
<li><a href="#orgb6d9c41">3.1. nuts2 data</a></li>
<li><a href="#org56bdb70">3.2. country data</a></li>
</ul>
</li>
<li><a href="#org1ad2e6e">4. Data</a>
<ul>
<li><a href="#orge9783c3">4.1. country data</a>
<ul>
<li><a href="#orgddef481">4.1.1. OOP per country</a></li>
<li><a href="#org30525bf">4.1.2. healthcare expenditure</a></li>
</ul>
</li>
<li><a href="#orgb0f68d9">4.2. nuts 2</a>
<ul>
<li><a href="#org6d80b0c">4.2.1. crude number of deaths and population by age and sex</a></li>
<li><a href="#org963d7f9">4.2.2. mortality lagged per age</a></li>
<li><a href="#orgf012b98">4.2.3. Poverty measures</a></li>
<li><a href="#orgfd28082">4.2.4. unmet needs</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3fd2bdd" class="outline-2">
<h2 id="org3fd2bdd"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This file describes how we get the data for our project on <a href="./index.html">the health effects of demand side cost sharing</a>.
</p>

<p>
In this file we explain how we get the data and from where and at the same time we generate the data. By generating the data in this way, a change in the data by Eurostat will lead to (slightly) different results.
</p>

<ul class="org-ul">
<li>Overview of data available at the region level: <a href="https://ec.europa.eu/eurostat/web/regions/background">https://ec.europa.eu/eurostat/web/regions/background</a></li>
<li>Link to excel file with overview: <a href="http://ec.europa.eu/eurostat/documents/140934/4381644/Regional-statistics-overview.xlsx">http://ec.europa.eu/eurostat/documents/140934/4381644/Regional-statistics-overview.xlsx</a></li>
</ul>
</div>
</div>





<div id="outline-container-org54177cd" class="outline-2">
<h2 id="org54177cd"><span class="section-number-2">2.</span> Preamble code</h2>
<div class="outline-text-2" id="text-2">
<p>
Run this code first before running the code of particular data sets. It imports the relevant libraries.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #89DDFF;">import</span> numpy <span style="color: #89DDFF;">as</span> np
<span style="color: #89DDFF;">import</span> pandas <span style="color: #89DDFF;">as</span> pd
<span style="color: #89DDFF;">from</span> country_codes <span style="color: #89DDFF;">import</span> oecd_dictionary, eurostat_dictionary
<span style="color: #89DDFF;">import</span> eurostat
<span style="color: #89DDFF;">import</span> xarray <span style="color: #89DDFF;">as</span> xr
<span style="color: #89DDFF;">import</span> matplotlib.pyplot <span style="color: #89DDFF;">as</span> plt

<span style="color: #ffcb6b;">EU_countries</span> = [<span style="color: #c3e88d;">'Belgium'</span>, <span style="color: #c3e88d;">'Bulgaria'</span>, <span style="color: #c3e88d;">'Czechia'</span>, <span style="color: #c3e88d;">'Denmark'</span>,
<span style="color: #c3e88d;">'Germany (until 1990 former territory of the FRG)'</span>, <span style="color: #c3e88d;">'Germany'</span>,<span style="color: #c3e88d;">'Estonia'</span>,
<span style="color: #c3e88d;">'Ireland'</span>, <span style="color: #c3e88d;">'Greece'</span>, <span style="color: #c3e88d;">'Spain'</span>, <span style="color: #c3e88d;">'France'</span>, <span style="color: #c3e88d;">'Croatia'</span>, <span style="color: #c3e88d;">'Italy'</span>,
<span style="color: #c3e88d;">'Cyprus'</span>, <span style="color: #c3e88d;">'Latvia'</span>, <span style="color: #c3e88d;">'Lithuania'</span>, <span style="color: #c3e88d;">'Luxembourg'</span>, <span style="color: #c3e88d;">'Hungary'</span>, <span style="color: #c3e88d;">'Malta'</span>,
<span style="color: #c3e88d;">'Netherlands'</span>, <span style="color: #c3e88d;">'Austria'</span>, <span style="color: #c3e88d;">'Poland'</span>, <span style="color: #c3e88d;">'Portugal'</span>, <span style="color: #c3e88d;">'Romania'</span>,
<span style="color: #c3e88d;">'Slovenia'</span>, <span style="color: #c3e88d;">'Slovakia'</span>, <span style="color: #c3e88d;">'Finland'</span>, <span style="color: #c3e88d;">'Sweden'</span>, <span style="color: #c3e88d;">'United Kingdom'</span>,
<span style="color: #c3e88d;">'Iceland'</span>, <span style="color: #c3e88d;">'Liechtenstein'</span>, <span style="color: #c3e88d;">'Norway'</span>, <span style="color: #c3e88d;">'Switzerland'</span>,
<span style="color: #c3e88d;">'Bosnia and Herzegovina'</span>]

</pre>
</div>
</div>
</div>

<div id="outline-container-org002c634" class="outline-2">
<h2 id="org002c634"><span class="section-number-2">3.</span> Combining data</h2>
<div class="outline-text-2" id="text-3">
<p>
The sections below generate the datasets per variable. The code in this section merges all these variables into one <code>.csv</code> file.
</p>
</div>
