getting_data.org
** nuts2 data

In this subsection, we merge the data at the NUTS 2 level.

#+begin_src jupyter-python :display plain

from glob import glob
ds_2 = xr.merge([xr.open_dataset(f) for f in glob('./data/*.nc')])
ds_2

#+end_src

#+RESULTS:
#+begin_example
<xarray.Dataset>
Dimensions:                          (age: 100, nuts2: 307, sex: 2, year: 31)
Coordinates:
  ,* age                              (age) float64 1.0 2.0 3.0 ... 99.0 100.0
  ,* nuts2                            (nuts2) object 'AL01' 'AL02' ... 'UKN0'
  ,* year                             (year) int64 1990 1991 1992 ... 2019 2020
  ,* sex                              (sex) object 'F' 'M'
Data variables:
    population                       (nuts2, year, sex, age) float64 nan ... nan
    at risk of poverty               (nuts2, year) float64 nan nan ... nan nan
    lagged_mortality                 (year, age, nuts2, sex) float64 nan ... nan
    percentage_material_deprivation  (nuts2, year) float64 nan nan ... nan nan
    deaths                           (nuts2, year, sex, age) float64 nan ... nan
    FEAR                             (nuts2, year) float64 nan nan ... nan nan
    HOPING                           (nuts2, year) float64 nan nan ... nan nan
    TOOEXP                           (nuts2, year) float64 nan nan ... nan nan
    TOOFAR                           (nuts2, year) float64 nan nan ... nan nan
    WAITING                          (nuts2, year) float64 nan nan ... nan nan
#+end_example

#+begin_src jupyter-python :display plain
df = ds_2.to_dataframe()
df.reset_index(inplace=True)
df.rename({'level_0':'age','level_1':'nuts2','level_3':'year'},axis=1,inplace=True)
df['country_code'] = df['nuts2'].str.slice(0,2)
df['nuts1'] = df['nuts2'].str.slice(0,3)
df['country'] = df['country_code'].replace(eurostat_dictionary)
df.head()
#+end_src

#+RESULTS:
#+begin_example
   age nuts2 sex  year  population  at risk of poverty  lagged_mortality  \
0  1.0  AL01   F  1990         NaN                 NaN               NaN   
1  1.0  AL01   F  1991         NaN                 NaN               NaN   
2  1.0  AL01   F  1992         NaN                 NaN               NaN   
3  1.0  AL01   F  1993         NaN                 NaN               NaN   
4  1.0  AL01   F  1994         NaN                 NaN               NaN   

   percentage_material_deprivation  deaths  FEAR  HOPING  TOOEXP  TOOFAR  \
0                              NaN     NaN   NaN     NaN     NaN     NaN   
1                              NaN     NaN   NaN     NaN     NaN     NaN   
2                              NaN     NaN   NaN     NaN     NaN     NaN   
3                              NaN     NaN   NaN     NaN     NaN     NaN   
4                              NaN     NaN   NaN     NaN     NaN     NaN   

   WAITING country_code nuts1  country  
0      NaN           AL   AL0  Albania  
1      NaN           AL   AL0  Albania  
2      NaN           AL   AL0  Albania  
3      NaN           AL   AL0  Albania  
4      NaN           AL   AL0  Albania  
#+end_example

