getting_data.html

<div id="outline-container-orgb6d9c41" class="outline-3">
<h3 id="orgb6d9c41"><span class="section-number-3">3.1.</span> nuts2 data</h3>
<div class="outline-text-3" id="text-3-1">
<p>
In this subsection, we merge the data at the NUTS 2 level.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python">
<span style="color: #89DDFF;">from</span> glob <span style="color: #89DDFF;">import</span> glob
<span style="color: #ffcb6b;">ds_2</span> = xr.merge([xr.open_dataset(f) <span style="color: #89DDFF;">for</span> f <span style="color: #89DDFF;">in</span> glob(<span style="color: #c3e88d;">'./data/*.nc'</span>)])
ds_2

</pre>
</div>

<pre class="example" id="org4141bc5">
&lt;xarray.Dataset&gt;
Dimensions:                          (age: 100, nuts2: 307, sex: 2, year: 31)
Coordinates:
  * age                              (age) float64 1.0 2.0 3.0 ... 99.0 100.0
  * nuts2                            (nuts2) object 'AL01' 'AL02' ... 'UKN0'
  * year                             (year) int64 1990 1991 1992 ... 2019 2020
  * sex                              (sex) object 'F' 'M'
Data variables:
    population                       (nuts2, year, sex, age) float64 nan ... nan
    at risk of poverty               (nuts2, year) float64 nan nan ... nan nan
    lagged_mortality                 (year, age, nuts2, sex) float64 nan ... nan
    percentage_material_deprivation  (nuts2, year) float64 nan nan ... nan nan
    deaths                           (nuts2, year, sex, age) float64 nan ... nan
    FEAR                             (nuts2, year) float64 nan nan ... nan nan
    HOPING                           (nuts2, year) float64 nan nan ... nan nan
    TOOEXP                           (nuts2, year) float64 nan nan ... nan nan
    TOOFAR                           (nuts2, year) float64 nan nan ... nan nan
    WAITING                          (nuts2, year) float64 nan nan ... nan nan
</pre>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">df</span> = ds_2.to_dataframe()
df.reset_index(inplace=<span style="color: #f78c6c;">True</span>)
df.rename({<span style="color: #c3e88d;">'level_0'</span>:<span style="color: #c3e88d;">'age'</span>,<span style="color: #c3e88d;">'level_1'</span>:<span style="color: #c3e88d;">'nuts2'</span>,<span style="color: #c3e88d;">'level_3'</span>:<span style="color: #c3e88d;">'year'</span>},axis=1,inplace=<span style="color: #f78c6c;">True</span>)
df[<span style="color: #c3e88d;">'country_code'</span>] = df[<span style="color: #c3e88d;">'nuts2'</span>].<span style="color: #82aaff;">str</span>.<span style="color: #82aaff;">slice</span>(0,2)
df[<span style="color: #c3e88d;">'nuts1'</span>] = df[<span style="color: #c3e88d;">'nuts2'</span>].<span style="color: #82aaff;">str</span>.<span style="color: #82aaff;">slice</span>(0,3)
df[<span style="color: #c3e88d;">'country'</span>] = df[<span style="color: #c3e88d;">'country_code'</span>].replace(eurostat_dictionary)
df.head()
</pre>
</div>

<pre class="example" id="org3c3380b">
   age nuts2 sex  year  population  at risk of poverty  lagged_mortality  \
0  1.0  AL01   F  1990         NaN                 NaN               NaN
1  1.0  AL01   F  1991         NaN                 NaN               NaN
2  1.0  AL01   F  1992         NaN                 NaN               NaN
3  1.0  AL01   F  1993         NaN                 NaN               NaN
4  1.0  AL01   F  1994         NaN                 NaN               NaN

   percentage_material_deprivation  deaths  FEAR  HOPING  TOOEXP  TOOFAR  \
0                              NaN     NaN   NaN     NaN     NaN     NaN
1                              NaN     NaN   NaN     NaN     NaN     NaN
2                              NaN     NaN   NaN     NaN     NaN     NaN
3                              NaN     NaN   NaN     NaN     NaN     NaN
4                              NaN     NaN   NaN     NaN     NaN     NaN

   WAITING country_code nuts1  country
0      NaN           AL   AL0  Albania
1      NaN           AL   AL0  Albania
2      NaN           AL   AL0  Albania
3      NaN           AL   AL0  Albania
4      NaN           AL   AL0  Albania
</pre>
</div>
</div>
