getting_data.org
** country data

In this section, we add country level variables to the dataframe.

#+begin_src jupyter-python :display plain

from glob import glob
ds_c = xr.merge([xr.open_dataset(f) for f in glob('./data/country/*.nc')])
ds_c

#+end_src

#+RESULTS:
#+begin_example
<xarray.Dataset>
Dimensions:                        (country: 33, country_code: 33, year: 28)
Coordinates:
  ,* year                           (year) int64 1992 1993 1994 ... 2018 2019
  ,* country                        (country) object 'Austria' ... 'United Kin...
  ,* country_code                   (country_code) object 'AT' 'BA' ... 'SK' 'UK'
Data variables:
    HF2_PC_CHE                     (country, country_code, year) float64 nan ...
    HF2_PPS_HAB                    (country, country_code, year) float64 nan ...
    HF3_PC_CHE                     (country, country_code, year) float64 nan ...
    HF3_PPS_HAB                    (country, country_code, year) float64 nan ...
    health expenditure per capita  (country, country_code, year) float64 ...
#+end_example

#+begin_src jupyter-python :display plain
df_country = ds_c.to_dataframe()
df_country.reset_index(inplace=True)
df_country.rename({'level_0':'country','level_1':'country_code','level_2':'year'},axis=1,inplace=True)
df_country.head()
#+end_src

#+RESULTS:
#+begin_example
   country country_code  year  HF2_PC_CHE  HF2_PPS_HAB  HF3_PC_CHE  \
0  Austria           AT  1992         NaN          NaN         NaN   
1  Austria           AT  1993         NaN          NaN         NaN   
2  Austria           AT  1994         NaN          NaN         NaN   
3  Austria           AT  1995         NaN          NaN         NaN   
4  Austria           AT  1996         NaN          NaN         NaN   

   HF3_PPS_HAB  health expenditure per capita  
0          NaN                            NaN  
1          NaN                            NaN  
2          NaN                            NaN  
3          NaN                            NaN  
4          NaN                            NaN  
#+end_example


#+begin_src jupyter-python :display plain
df = df.merge(df_country, how = 'left', on = ['country','year','country_code'])

df = df[(df.population >= df.deaths) & (df.population > 0)] # drop rows where deaths > population at Jan. 1st (e.g. because people moved in the year)
df['mortality'] = df.deaths/df.population

df.head()
#+end_src

#+RESULTS:
#+begin_example
     age nuts2 sex  year  population  at risk of poverty  lagged_mortality  \
186  1.0  AT11   F  1990      1345.0                 NaN               NaN   
187  1.0  AT11   F  1991      1371.0                 NaN               NaN   
188  1.0  AT11   F  1992      1436.0                 NaN               NaN   
189  1.0  AT11   F  1993      1372.0                 NaN               NaN   
190  1.0  AT11   F  1994      1349.0                 NaN               NaN   

     percentage_material_deprivation  deaths  FEAR  ...  WAITING  \
186                              NaN     0.0   NaN  ...      NaN   
187                              NaN     0.0   NaN  ...      NaN   
188                              NaN     1.0   NaN  ...      NaN   
189                              NaN     0.0   NaN  ...      NaN   
190                              NaN     1.0   NaN  ...      NaN   

     country_code  nuts1  country HF2_PC_CHE HF2_PPS_HAB HF3_PC_CHE  \
186            AT    AT1  Austria        NaN         NaN        NaN   
187            AT    AT1  Austria        NaN         NaN        NaN   
188            AT    AT1  Austria        NaN         NaN        NaN   
189            AT    AT1  Austria        NaN         NaN        NaN   
190            AT    AT1  Austria        NaN         NaN        NaN   

     HF3_PPS_HAB  health expenditure per capita  mortality  
186          NaN                            NaN   0.000000  
187          NaN                            NaN   0.000000  
188          NaN                            NaN   0.000696  
189          NaN                            NaN   0.000000  
190          NaN                            NaN   0.000741  

[5 rows x 23 columns]
#+end_example

Finally, we save the merged NUTS 2 and country data into a =.csv= file.

#+begin_src jupyter-python :display plain
df.to_csv('./data/data_deaths_by_age_nuts_2.csv')
#+end_src

#+RESULTS:

* Data

First, we fetch the variables at the country level from the Eurostat website. Then we move to the NUTS 2 regional data.

** country data

