getting_data.html

<div id="outline-container-org56bdb70" class="outline-3">
<h3 id="org56bdb70"><span class="section-number-3">3.2.</span> country data</h3>
<div class="outline-text-3" id="text-3-2">
<p>
In this section, we add country level variables to the dataframe.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python">
<span style="color: #89DDFF;">from</span> glob <span style="color: #89DDFF;">import</span> glob
<span style="color: #ffcb6b;">ds_c</span> = xr.merge([xr.open_dataset(f) <span style="color: #89DDFF;">for</span> f <span style="color: #89DDFF;">in</span> glob(<span style="color: #c3e88d;">'./data/country/*.nc'</span>)])
ds_c

</pre>
</div>

<pre class="example" id="org2ded782">
&lt;xarray.Dataset&gt;
Dimensions:                        (country: 33, country_code: 33, year: 28)
Coordinates:
  * year                           (year) int64 1992 1993 1994 ... 2018 2019
  * country                        (country) object 'Austria' ... 'United Kin...
  * country_code                   (country_code) object 'AT' 'BA' ... 'SK' 'UK'
Data variables:
    HF2_PC_CHE                     (country, country_code, year) float64 nan ...
    HF2_PPS_HAB                    (country, country_code, year) float64 nan ...
    HF3_PC_CHE                     (country, country_code, year) float64 nan ...
    HF3_PPS_HAB                    (country, country_code, year) float64 nan ...
    health expenditure per capita  (country, country_code, year) float64 ...
</pre>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">df_country</span> = ds_c.to_dataframe()
df_country.reset_index(inplace=<span style="color: #f78c6c;">True</span>)
df_country.rename({<span style="color: #c3e88d;">'level_0'</span>:<span style="color: #c3e88d;">'country'</span>,<span style="color: #c3e88d;">'level_1'</span>:<span style="color: #c3e88d;">'country_code'</span>,<span style="color: #c3e88d;">'level_2'</span>:<span style="color: #c3e88d;">'year'</span>},axis=1,inplace=<span style="color: #f78c6c;">True</span>)
df_country.head()
</pre>
</div>

<pre class="example" id="org83e6283">
   country country_code  year  HF2_PC_CHE  HF2_PPS_HAB  HF3_PC_CHE  \
0  Austria           AT  1992         NaN          NaN         NaN
1  Austria           AT  1993         NaN          NaN         NaN
2  Austria           AT  1994         NaN          NaN         NaN
3  Austria           AT  1995         NaN          NaN         NaN
4  Austria           AT  1996         NaN          NaN         NaN

   HF3_PPS_HAB  health expenditure per capita
0          NaN                            NaN
1          NaN                            NaN
2          NaN                            NaN
3          NaN                            NaN
4          NaN                            NaN
</pre>


<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">df</span> = df.merge(df_country, how = <span style="color: #c3e88d;">'left'</span>, on = [<span style="color: #c3e88d;">'country'</span>,<span style="color: #c3e88d;">'year'</span>,<span style="color: #c3e88d;">'country_code'</span>])

df = df[(df.population &gt;= df.deaths) &amp; (df.population &gt; 0)] <span style="color: #676E95;"># </span><span style="color: #676E95;">drop rows where deaths &gt; population at Jan. 1st (e.g. because people moved in the year)</span>
df[<span style="color: #c3e88d;">'mortality'</span>] = df.deaths/df.population

df.head()
</pre>
</div>

<pre class="example" id="org3768b30">
     age nuts2 sex  year  population  at risk of poverty  lagged_mortality  \
186  1.0  AT11   F  1990      1345.0                 NaN               NaN
187  1.0  AT11   F  1991      1371.0                 NaN               NaN
188  1.0  AT11   F  1992      1436.0                 NaN               NaN
189  1.0  AT11   F  1993      1372.0                 NaN               NaN
190  1.0  AT11   F  1994      1349.0                 NaN               NaN

     percentage_material_deprivation  deaths  FEAR  ...  WAITING  \
186                              NaN     0.0   NaN  ...      NaN
187                              NaN     0.0   NaN  ...      NaN
188                              NaN     1.0   NaN  ...      NaN
189                              NaN     0.0   NaN  ...      NaN
190                              NaN     1.0   NaN  ...      NaN

     country_code  nuts1  country HF2_PC_CHE HF2_PPS_HAB HF3_PC_CHE  \
186            AT    AT1  Austria        NaN         NaN        NaN
187            AT    AT1  Austria        NaN         NaN        NaN
188            AT    AT1  Austria        NaN         NaN        NaN
189            AT    AT1  Austria        NaN         NaN        NaN
190            AT    AT1  Austria        NaN         NaN        NaN

     HF3_PPS_HAB  health expenditure per capita  mortality
186          NaN                            NaN   0.000000
187          NaN                            NaN   0.000000
188          NaN                            NaN   0.000696
189          NaN                            NaN   0.000000
190          NaN                            NaN   0.000741

[5 rows x 23 columns]
</pre>

<p>
Finally, we save the merged NUTS 2 and country data into a <code>.csv</code> file.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python">df.to_csv(<span style="color: #c3e88d;">'./data/data_deaths_by_age_nuts_2.csv'</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1ad2e6e" class="outline-2">
<h2 id="org1ad2e6e"><span class="section-number-2">4.</span> Data</h2>
<div class="outline-text-2" id="text-4">
<p>
First, we fetch the variables at the country level from the Eurostat website. Then we move to the NUTS 2 regional data.
</p>
</div>
