getting_data.org
*** OOP per country

We want a measure of "how generous" a healthcare system is in terms of oop-payments. This feature of the healthcare system tends to be defined at the country level. We use household oop payment and expenditure on voluntary payment schemes (for things that are not covered by basic or mandatory insurance).

- link to data: https://ec.europa.eu/eurostat/databrowser/view/hlth_sha11_hf/default/table?lang=en

| abbreviation | name                                                       |
|--------------+------------------------------------------------------------|
| HF2          | Voluntary health care payment schemes                      |
| HF3          | Household out-of-pocket payment                            |
| PC_CHE       | Percentual share of total current health expenditure (CHE) |
| PPS_HAB      | Purchasing power standard (PPS) per inhabitant             |


#+begin_src jupyter-python :display plain
df = eurostat.get_data_df('hlth_sha11_hf')
df.rename({'geo\\time':'geo'},inplace=True,axis=1)
df['country_code'] = [x[:2] for x in df['geo']]
df['country'] = df['country_code'].replace(eurostat_dictionary)
df = df[df.country.isin(EU_countries)  & (df.icha11_hf.isin(["HF2", "HF3"])) & (df.unit.isin([ 'PC_CHE','PPS_HAB']))]
df.drop(["geo"],axis=1,inplace=True)

df = pd.melt(df,id_vars=['country','country_code','unit','icha11_hf'],
                        value_vars=np.arange(1992,2019),
                        var_name='year',value_name='health_expenditure')
df.set_index(['country','country_code','year','unit','icha11_hf'],inplace=True)
df = df.unstack()
df.columns = df.columns.droplevel()
df = df.unstack()
df.columns = df.columns.droplevel()
df.columns = ['HF2_PC_CHE','HF2_PPS_HAB','HF3_PC_CHE','HF3_PPS_HAB']
df.reset_index(inplace=True)
df.set_index(['country','country_code','year'],inplace=True)
df.tail()
#+end_src

#+RESULTS:
#+begin_example
                                  HF2_PC_CHE  HF2_PPS_HAB  HF3_PC_CHE  \
country        country_code year
United Kingdom UK           2014        5.40       155.48       15.16
                            2015        5.40       161.07       15.23
                            2016        5.04       148.46       15.37
                            2017        5.41       160.78       15.72
                            2018        5.62       172.06       15.88

                                  HF3_PPS_HAB
country        country_code year
United Kingdom UK           2014       436.73
                            2015       454.78
                            2016       453.16
                            2017       467.53
                            2018       486.25
#+end_example

#+begin_src jupyter-python :display plain
ds = df.to_xarray()
ds.to_netcdf("./data/country/out_of_pocket.nc")
ds
#+end_src

#+RESULTS:
#+begin_example
<xarray.Dataset>
Dimensions:       (country: 33, country_code: 33, year: 27)
Coordinates:
  ,* country       (country) object 'Austria' 'Belgium' ... 'United Kingdom'
  ,* country_code  (country_code) object 'AT' 'BA' 'BE' 'BG' ... 'SI' 'SK' 'UK'
  ,* year          (year) int64 1992 1993 1994 1995 1996 ... 2015 2016 2017 2018
Data variables:
    HF2_PC_CHE    (country, country_code, year) float64 nan nan ... 5.41 5.62
    HF2_PPS_HAB   (country, country_code, year) float64 nan nan ... 160.8 172.1
    HF3_PC_CHE    (country, country_code, year) float64 nan nan ... 15.72 15.88
    HF3_PPS_HAB   (country, country_code, year) float64 nan nan ... 467.5 486.2
#+end_example




