getting_data.html

<div id="outline-container-orge9783c3" class="outline-3">
<h3 id="orge9783c3"><span class="section-number-3">4.1.</span> country data</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orgddef481" class="outline-4">
<h4 id="orgddef481"><span class="section-number-4">4.1.1.</span> OOP per country</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
We want a measure of "how generous" a healthcare system is in terms of oop-payments. This feature of the healthcare system tends to be defined at the country level. We use household oop payment and expenditure on voluntary payment schemes (for things that are not covered by basic or mandatory insurance).
</p>

<ul class="org-ul">
<li>link to data: <a href="https://ec.europa.eu/eurostat/databrowser/view/hlth_sha11_hf/default/table?lang=en">https://ec.europa.eu/eurostat/databrowser/view/hlth_sha11_hf/default/table?lang=en</a></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">abbreviation</th>
<th scope="col" class="org-left">name</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">HF2</td>
<td class="org-left">Voluntary health care payment schemes</td>
</tr>

<tr>
<td class="org-left">HF3</td>
<td class="org-left">Household out-of-pocket payment</td>
</tr>

<tr>
<td class="org-left">PC_CHE</td>
<td class="org-left">Percentual share of total current health expenditure (CHE)</td>
</tr>

<tr>
<td class="org-left">PPS_HAB</td>
<td class="org-left">Purchasing power standard (PPS) per inhabitant</td>
</tr>
</tbody>
</table>


<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">df</span> = eurostat.get_data_df(<span style="color: #c3e88d;">'hlth_sha11_hf'</span>)
df.rename({<span style="color: #c3e88d;">'geo\\time'</span>:<span style="color: #c3e88d;">'geo'</span>},inplace=<span style="color: #f78c6c;">True</span>,axis=1)
df[<span style="color: #c3e88d;">'country_code'</span>] = [x[:2] <span style="color: #89DDFF;">for</span> x <span style="color: #89DDFF;">in</span> df[<span style="color: #c3e88d;">'geo'</span>]]
df[<span style="color: #c3e88d;">'country'</span>] = df[<span style="color: #c3e88d;">'country_code'</span>].replace(eurostat_dictionary)
df = df[df.country.isin(EU_countries)  &amp; (df.icha11_hf.isin([<span style="color: #c3e88d;">"HF2"</span>, <span style="color: #c3e88d;">"HF3"</span>])) &amp; (df.unit.isin([ <span style="color: #c3e88d;">'PC_CHE'</span>,<span style="color: #c3e88d;">'PPS_HAB'</span>]))]
df.drop([<span style="color: #c3e88d;">"geo"</span>],axis=1,inplace=<span style="color: #f78c6c;">True</span>)

df = pd.melt(df,id_vars=[<span style="color: #c3e88d;">'country'</span>,<span style="color: #c3e88d;">'country_code'</span>,<span style="color: #c3e88d;">'unit'</span>,<span style="color: #c3e88d;">'icha11_hf'</span>],
                        value_vars=np.arange(1992,2019),
                        var_name=<span style="color: #c3e88d;">'year'</span>,value_name=<span style="color: #c3e88d;">'health_expenditure'</span>)
df.set_index([<span style="color: #c3e88d;">'country'</span>,<span style="color: #c3e88d;">'country_code'</span>,<span style="color: #c3e88d;">'year'</span>,<span style="color: #c3e88d;">'unit'</span>,<span style="color: #c3e88d;">'icha11_hf'</span>],inplace=<span style="color: #f78c6c;">True</span>)
df = df.unstack()
df.columns = df.columns.droplevel()
df = df.unstack()
df.columns = df.columns.droplevel()
df.columns = [<span style="color: #c3e88d;">'HF2_PC_CHE'</span>,<span style="color: #c3e88d;">'HF2_PPS_HAB'</span>,<span style="color: #c3e88d;">'HF3_PC_CHE'</span>,<span style="color: #c3e88d;">'HF3_PPS_HAB'</span>]
df.reset_index(inplace=<span style="color: #f78c6c;">True</span>)
df.set_index([<span style="color: #c3e88d;">'country'</span>,<span style="color: #c3e88d;">'country_code'</span>,<span style="color: #c3e88d;">'year'</span>],inplace=<span style="color: #f78c6c;">True</span>)
df.tail()
</pre>
</div>

<pre class="example" id="org3e4ad89">
                                  HF2_PC_CHE  HF2_PPS_HAB  HF3_PC_CHE  \
country        country_code year
United Kingdom UK           2014        5.40       155.48       15.16
                            2015        5.40       161.07       15.23
                            2016        5.04       148.46       15.37
                            2017        5.41       160.78       15.72
                            2018        5.62       172.06       15.88

                                  HF3_PPS_HAB
country        country_code year
United Kingdom UK           2014       436.73
                            2015       454.78
                            2016       453.16
                            2017       467.53
                            2018       486.25
</pre>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">ds</span> = df.to_xarray()
ds.to_netcdf(<span style="color: #c3e88d;">"./data/country/out_of_pocket.nc"</span>)
ds
</pre>
</div>

<pre class="example" id="org034e379">
&lt;xarray.Dataset&gt;
Dimensions:       (country: 33, country_code: 33, year: 27)
Coordinates:
  * country       (country) object 'Austria' 'Belgium' ... 'United Kingdom'
  * country_code  (country_code) object 'AT' 'BA' 'BE' 'BG' ... 'SI' 'SK' 'UK'
  * year          (year) int64 1992 1993 1994 1995 1996 ... 2015 2016 2017 2018
Data variables:
    HF2_PC_CHE    (country, country_code, year) float64 nan nan ... 5.41 5.62
    HF2_PPS_HAB   (country, country_code, year) float64 nan nan ... 160.8 172.1
    HF3_PC_CHE    (country, country_code, year) float64 nan nan ... 15.72 15.88
    HF3_PPS_HAB   (country, country_code, year) float64 nan nan ... 467.5 486.2
</pre>
</div>
</div>
