getting_data.org
*** healthcare expenditure

- link to date: https://ec.europa.eu/eurostat/databrowser/view/hlth_sha11_hc/default/table?lang=en

| abbreviation | variable name                         |
|--------------+---------------------------------------|
| TOT_HC       | Current health care expenditure (CHE) |
| EUR_HAB      | Euro per inhabitant                   |


#+begin_src jupyter-python :display plain
df = eurostat.get_data_df('hlth_sha11_hc')
df.rename({'geo\\time':'geo'},inplace=True,axis=1)
df['country_code'] = [x[:2] for x in df['geo']]
df['country'] = df['country_code'].replace(eurostat_dictionary)
df = df[df.country.isin(EU_countries)  & (df.icha11_hc.isin(["TOT_HC"])) & (df.unit.isin(['EUR_HAB']))]
df.drop(["geo"],axis=1,inplace=True)

df = pd.melt(df,id_vars=['country','country_code','unit','icha11_hc'],
                        value_vars=np.arange(1992,2020),
                        var_name='year',value_name='health_expenditure')
df.set_index(['country','country_code','year','unit','icha11_hc'],inplace=True)
df = df.unstack()
df.columns = df.columns.droplevel()
df = df.unstack()
df.columns = df.columns.droplevel()
df.reset_index(inplace=True)
# df.columns = ['HF2_PC_CHE','HF2_PPS_HAB','HF3_PC_CHE','HF3_PPS_HAB']
df.rename({'EUR_HAB':'health expenditure per capita'},axis=1,inplace=True)
# df.reset_index(inplace=True)
df.set_index(['country','country_code','year'],inplace=True)
df.head()
#+end_src

#+RESULTS:
: unit                       health expenditure per capita
: country country_code year
: Austria AT           1992                            NaN
:                      1993                            NaN
:                      1994                            NaN
:                      1995                            NaN
:                      1996                            NaN


#+begin_src jupyter-python :display plain
ds = df.to_xarray()
ds.to_netcdf("./data/country/healthcare_expenditure.nc")
ds
#+end_src

#+RESULTS:
: <xarray.Dataset>
: Dimensions:                        (country: 33, country_code: 33, year: 28)
: Coordinates:
:   * country                        (country) object 'Austria' ... 'United Kin...
:   * country_code                   (country_code) object 'AT' 'BA' ... 'SK' 'UK'
:   * year                           (year) int64 1992 1993 1994 ... 2018 2019
: Data variables:
:     health expenditure per capita  (country, country_code, year) float64 nan ...



** nuts 2


- overview of regional data: https://ec.europa.eu/eurostat/web/regions/data/database

