getting_data.html




<div id="outline-container-org30525bf" class="outline-4">
<h4 id="org30525bf"><span class="section-number-4">4.1.2.</span> healthcare expenditure</h4>
<div class="outline-text-4" id="text-4-1-2">
<ul class="org-ul">
<li>link to date: <a href="https://ec.europa.eu/eurostat/databrowser/view/hlth_sha11_hc/default/table?lang=en">https://ec.europa.eu/eurostat/databrowser/view/hlth_sha11_hc/default/table?lang=en</a></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">abbreviation</th>
<th scope="col" class="org-left">variable name</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">TOT_HC</td>
<td class="org-left">Current health care expenditure (CHE)</td>
</tr>

<tr>
<td class="org-left">EUR_HAB</td>
<td class="org-left">Euro per inhabitant</td>
</tr>
</tbody>
</table>


<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">df</span> = eurostat.get_data_df(<span style="color: #c3e88d;">'hlth_sha11_hc'</span>)
df.rename({<span style="color: #c3e88d;">'geo\\time'</span>:<span style="color: #c3e88d;">'geo'</span>},inplace=<span style="color: #f78c6c;">True</span>,axis=1)
df[<span style="color: #c3e88d;">'country_code'</span>] = [x[:2] <span style="color: #89DDFF;">for</span> x <span style="color: #89DDFF;">in</span> df[<span style="color: #c3e88d;">'geo'</span>]]
df[<span style="color: #c3e88d;">'country'</span>] = df[<span style="color: #c3e88d;">'country_code'</span>].replace(eurostat_dictionary)
df = df[df.country.isin(EU_countries)  &amp; (df.icha11_hc.isin([<span style="color: #c3e88d;">"TOT_HC"</span>])) &amp; (df.unit.isin([<span style="color: #c3e88d;">'EUR_HAB'</span>]))]
df.drop([<span style="color: #c3e88d;">"geo"</span>],axis=1,inplace=<span style="color: #f78c6c;">True</span>)

df = pd.melt(df,id_vars=[<span style="color: #c3e88d;">'country'</span>,<span style="color: #c3e88d;">'country_code'</span>,<span style="color: #c3e88d;">'unit'</span>,<span style="color: #c3e88d;">'icha11_hc'</span>],
                        value_vars=np.arange(1992,2020),
                        var_name=<span style="color: #c3e88d;">'year'</span>,value_name=<span style="color: #c3e88d;">'health_expenditure'</span>)
df.set_index([<span style="color: #c3e88d;">'country'</span>,<span style="color: #c3e88d;">'country_code'</span>,<span style="color: #c3e88d;">'year'</span>,<span style="color: #c3e88d;">'unit'</span>,<span style="color: #c3e88d;">'icha11_hc'</span>],inplace=<span style="color: #f78c6c;">True</span>)
df = df.unstack()
df.columns = df.columns.droplevel()
df = df.unstack()
df.columns = df.columns.droplevel()
df.reset_index(inplace=<span style="color: #f78c6c;">True</span>)
<span style="color: #676E95;"># </span><span style="color: #676E95;">df.columns = ['HF2_PC_CHE','HF2_PPS_HAB','HF3_PC_CHE','HF3_PPS_HAB']</span>
df.rename({<span style="color: #c3e88d;">'EUR_HAB'</span>:<span style="color: #c3e88d;">'health expenditure per capita'</span>},axis=1,inplace=<span style="color: #f78c6c;">True</span>)
<span style="color: #676E95;"># </span><span style="color: #676E95;">df.reset_index(inplace=True)</span>
df.set_index([<span style="color: #c3e88d;">'country'</span>,<span style="color: #c3e88d;">'country_code'</span>,<span style="color: #c3e88d;">'year'</span>],inplace=<span style="color: #f78c6c;">True</span>)
df.head()
</pre>
</div>

<pre class="example">
unit                       health expenditure per capita
country country_code year
Austria AT           1992                            NaN
                     1993                            NaN
                     1994                            NaN
                     1995                            NaN
                     1996                            NaN
</pre>



<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">ds</span> = df.to_xarray()
ds.to_netcdf(<span style="color: #c3e88d;">"./data/country/healthcare_expenditure.nc"</span>)
ds
</pre>
</div>

<pre class="example">
&lt;xarray.Dataset&gt;
Dimensions:                        (country: 33, country_code: 33, year: 28)
Coordinates:
  * country                        (country) object 'Austria' ... 'United Kin...
  * country_code                   (country_code) object 'AT' 'BA' ... 'SK' 'UK'
  * year                           (year) int64 1992 1993 1994 ... 2018 2019
Data variables:
    health expenditure per capita  (country, country_code, year) float64 nan ...
</pre>
</div>
</div>
</div>



<div id="outline-container-orgb0f68d9" class="outline-3">
<h3 id="orgb0f68d9"><span class="section-number-3">4.2.</span> nuts 2</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>overview of regional data: <a href="https://ec.europa.eu/eurostat/web/regions/data/database">https://ec.europa.eu/eurostat/web/regions/data/database</a></li>
</ul>
</div>
