getting_data.org
*** crude number of deaths and population by age and sex


- population: https://ec.europa.eu/eurostat/databrowser/view/demo_r_d2jan/default/table?lang=en


#+begin_src jupyter-python :display plain
df = eurostat.get_data_df('demo_r_d2jan')
df.rename({'geo\\time':'geo'},inplace=True,axis=1)
age_range = ['Y1', 'Y10', 'Y11', 'Y12', 'Y13', 'Y14', 'Y15',
       'Y16', 'Y17', 'Y18', 'Y19', 'Y2', 'Y20', 'Y21', 'Y22', 'Y23',
       'Y24', 'Y25', 'Y26', 'Y27', 'Y28', 'Y29', 'Y3', 'Y30', 'Y31',
       'Y32', 'Y33', 'Y34', 'Y35', 'Y36', 'Y37', 'Y38', 'Y39', 'Y4',
       'Y40', 'Y41', 'Y42', 'Y43', 'Y44', 'Y45', 'Y46', 'Y47', 'Y48',
       'Y49', 'Y5', 'Y50', 'Y51', 'Y52', 'Y53', 'Y54', 'Y55', 'Y56',
       'Y57', 'Y58', 'Y59', 'Y6', 'Y60', 'Y61', 'Y62', 'Y63', 'Y64',
       'Y65', 'Y66', 'Y67', 'Y68', 'Y69', 'Y7', 'Y70', 'Y71', 'Y72',
       'Y73', 'Y74', 'Y75', 'Y76', 'Y77', 'Y78', 'Y79', 'Y8', 'Y80',
       'Y81', 'Y82', 'Y83', 'Y84', 'Y85', 'Y86', 'Y87', 'Y88', 'Y89',
       'Y9', 'Y90', 'Y91', 'Y92', 'Y93', 'Y94', 'Y95', 'Y96', 'Y97',
       'Y98', 'Y99']
df['country_code'] = [x[:2] for x in df['geo']]
df['country'] = df['country_code'].replace(eurostat_dictionary)
df = df[df.country.isin(EU_countries) & (df.sex.isin(["M","F"])) & (df.age.isin(age_range))]
df.drop(['country','country_code'],axis=1,inplace=True)
df = pd.melt(df,id_vars=['geo','sex','age'],
                        value_vars=np.arange(1990,2021),
                        var_name='year',value_name='population')
df['nuts'] = [len(x)-2 for x in df.geo]
df = df.query('nuts == 2')
df.drop('nuts',inplace=True, axis=1)
df.rename({'geo':'nuts2', 'age':'age string'},axis=1,inplace=True)
df['age'] = [float(x.replace('Y','')) for x in df['age string']]
df.drop('age string',inplace=True, axis=1)

df.set_index(['nuts2','year','sex','age'],inplace=True)

df.head()
#+end_src

#+RESULTS:
#+begin_example
     unit sex age   geo     2020     2019     2018     2017     2016     2015  \
1021   NR   F  Y1    AT  42255.0  42850.0  43340.0  41498.0  40860.0  39284.0
1022   NR   F  Y1   AT1  18442.0  18677.0  19094.0  18108.0  17897.0  17148.0
1023   NR   F  Y1  AT11   1172.0   1158.0   1163.0   1142.0   1106.0   1096.0
1024   NR   F  Y1  AT12   7587.0   7623.0   7752.0   7367.0   7402.0   7148.0
1025   NR   F  Y1  AT13   9683.0   9896.0  10179.0   9599.0   9389.0   8904.0

      ...     1999     1998     1997     1996     1995     1994     1993  \
1021  ...  41388.0  43312.0  43299.0  45079.0  46320.0  46324.0  46573.0
1022  ...  16281.0  16937.0  17000.0  17574.0  18228.0  18038.0  18327.0
1023  ...   1219.0   1275.0   1311.0   1325.0   1422.0   1349.0   1372.0
1024  ...   7703.0   8088.0   8107.0   8459.0   8775.0   8556.0   8883.0
1025  ...   7359.0   7574.0   7582.0   7790.0   8031.0   8133.0   8072.0

         1992     1991     1990
1021  45035.0  43825.0  43094.0
1022  17499.0  17038.0  16623.0
1023   1436.0   1371.0   1345.0
1024   8412.0   8234.0   8038.0
1025   7651.0   7433.0   7240.0

[5 rows x 35 columns]
#+end_example



#+begin_src jupyter-python :display plain
ds = df.to_xarray()
ds.to_netcdf("./data/population_nuts_2.nc")
ds
#+end_src

#+RESULTS:
: <xarray.Dataset>
: Dimensions:     (age: 99, nuts2: 299, sex: 2, year: 31)
: Coordinates:
:   * nuts2       (nuts2) object 'AT11' 'AT12' 'AT13' ... 'UKM8' 'UKM9' 'UKN0'
:   * year        (year) int64 1990 1991 1992 1993 1994 ... 2017 2018 2019 2020
:   * sex         (sex) object 'F' 'M'
:   * age         (age) float64 1.0 2.0 3.0 4.0 5.0 ... 95.0 96.0 97.0 98.0 99.0
: Data variables:
:     population  (nuts2, year, sex, age) float64 1.345e+03 1.349e+03 ... nan nan



- deaths: https://ec.europa.eu/eurostat/databrowser/view/demo_r_magec/default/table?lang=en


#+begin_src jupyter-python :display plain
df = eurostat.get_data_df('demo_r_magec')
df.rename({'geo\\time':'geo'},inplace=True,axis=1)
age_range = ['Y1', 'Y10', 'Y11', 'Y12', 'Y13', 'Y14', 'Y15',
       'Y16', 'Y17', 'Y18', 'Y19', 'Y2', 'Y20', 'Y21', 'Y22', 'Y23',
       'Y24', 'Y25', 'Y26', 'Y27', 'Y28', 'Y29', 'Y3', 'Y30', 'Y31',
       'Y32', 'Y33', 'Y34', 'Y35', 'Y36', 'Y37', 'Y38', 'Y39', 'Y4',
       'Y40', 'Y41', 'Y42', 'Y43', 'Y44', 'Y45', 'Y46', 'Y47', 'Y48',
       'Y49', 'Y5', 'Y50', 'Y51', 'Y52', 'Y53', 'Y54', 'Y55', 'Y56',
       'Y57', 'Y58', 'Y59', 'Y6', 'Y60', 'Y61', 'Y62', 'Y63', 'Y64',
       'Y65', 'Y66', 'Y67', 'Y68', 'Y69', 'Y7', 'Y70', 'Y71', 'Y72',
       'Y73', 'Y74', 'Y75', 'Y76', 'Y77', 'Y78', 'Y79', 'Y8', 'Y80',
       'Y81', 'Y82', 'Y83', 'Y84', 'Y85', 'Y86', 'Y87', 'Y88', 'Y89',
       'Y9', 'Y90', 'Y91', 'Y92', 'Y93', 'Y94', 'Y95', 'Y96', 'Y97',
       'Y98', 'Y99']
df['country_code'] = [x[:2] for x in df['geo']]
df['country'] = df['country_code'].replace(eurostat_dictionary)
df = df[df.country.isin(EU_countries) & (df.sex.isin(["M","F"])) & (df.age.isin(age_range))]
df.drop(['country','country_code'],axis=1,inplace=True)
df = pd.melt(df,id_vars=['geo','sex','age'],
                        value_vars=np.arange(1990,2020),
                        var_name='year',value_name='deaths')
df['nuts'] = [len(x)-2 for x in df.geo]
df = df.query('nuts == 2')
df.drop('nuts',inplace=True, axis=1)
df.rename({'geo':'nuts2', 'age':'age string'},axis=1,inplace=True)
df['age'] = [float(x.replace('Y','')) for x in df['age string']]
df.drop('age string',inplace=True, axis=1)

df.set_index(['nuts2','year','sex','age'],inplace=True)

df.head()
#+end_src

#+RESULTS:
#+begin_example
     unit sex age   geo  2019  2018  2017  2016  2015  2014  ...  1999  1998  \
1021   NR   F  Y1    AT  11.0   9.0   7.0  11.0   7.0   6.0  ...  14.0  16.0
1022   NR   F  Y1   AT1   2.0   6.0   2.0   3.0   4.0   4.0  ...   3.0   8.0
1023   NR   F  Y1  AT11   0.0   2.0   0.0   0.0   0.0   0.0  ...   0.0   0.0
1024   NR   F  Y1  AT12   2.0   1.0   1.0   1.0   1.0   2.0  ...   2.0   5.0
1025   NR   F  Y1  AT13   0.0   3.0   1.0   2.0   3.0   2.0  ...   1.0   3.0

      1997  1996  1995  1994  1993  1992  1991  1990
1021  17.0  15.0  16.0  23.0  30.0  26.0  23.0  29.0
1022   4.0   4.0   NaN  13.0  12.0  11.0   7.0  11.0
1023   0.0   0.0   NaN   1.0   0.0   1.0   0.0   0.0
1024   3.0   1.0   NaN   5.0   3.0   5.0   1.0   7.0
1025   1.0   3.0   NaN   7.0   9.0   5.0   6.0   4.0

[5 rows x 34 columns]
#+end_example



#+begin_src jupyter-python :display plain
ds = df.to_xarray()
ds.to_netcdf("./data/deaths_nuts_2.nc")
ds
#+end_src

#+RESULTS:
: <xarray.Dataset>
: Dimensions:  (age: 99, nuts2: 299, sex: 2, year: 30)
: Coordinates:
:   * nuts2    (nuts2) object 'AT11' 'AT12' 'AT13' 'AT21' ... 'UKM8' 'UKM9' 'UKN0'
:   * year     (year) int64 1990 1991 1992 1993 1994 ... 2015 2016 2017 2018 2019
:   * sex      (sex) object 'F' 'M'
:   * age      (age) float64 1.0 2.0 3.0 4.0 5.0 6.0 ... 95.0 96.0 97.0 98.0 99.0
: Data variables:
:     deaths   (nuts2, year, sex, age) float64 0.0 0.0 1.0 1.0 ... nan nan nan nan


