getting_data.html

<div id="outline-container-org6d80b0c" class="outline-4">
<h4 id="org6d80b0c"><span class="section-number-4">4.2.1.</span> crude number of deaths and population by age and sex</h4>
<div class="outline-text-4" id="text-4-2-1">
<ul class="org-ul">
<li>population: <a href="https://ec.europa.eu/eurostat/databrowser/view/demo_r_d2jan/default/table?lang=en">https://ec.europa.eu/eurostat/databrowser/view/demo_r_d2jan/default/table?lang=en</a></li>
</ul>


<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">df</span> = eurostat.get_data_df(<span style="color: #c3e88d;">'demo_r_d2jan'</span>)
df.rename({<span style="color: #c3e88d;">'geo\\time'</span>:<span style="color: #c3e88d;">'geo'</span>},inplace=<span style="color: #f78c6c;">True</span>,axis=1)
age_range = [<span style="color: #c3e88d;">'Y1'</span>, <span style="color: #c3e88d;">'Y10'</span>, <span style="color: #c3e88d;">'Y11'</span>, <span style="color: #c3e88d;">'Y12'</span>, <span style="color: #c3e88d;">'Y13'</span>, <span style="color: #c3e88d;">'Y14'</span>, <span style="color: #c3e88d;">'Y15'</span>,
       <span style="color: #c3e88d;">'Y16'</span>, <span style="color: #c3e88d;">'Y17'</span>, <span style="color: #c3e88d;">'Y18'</span>, <span style="color: #c3e88d;">'Y19'</span>, <span style="color: #c3e88d;">'Y2'</span>, <span style="color: #c3e88d;">'Y20'</span>, <span style="color: #c3e88d;">'Y21'</span>, <span style="color: #c3e88d;">'Y22'</span>, <span style="color: #c3e88d;">'Y23'</span>,
       <span style="color: #c3e88d;">'Y24'</span>, <span style="color: #c3e88d;">'Y25'</span>, <span style="color: #c3e88d;">'Y26'</span>, <span style="color: #c3e88d;">'Y27'</span>, <span style="color: #c3e88d;">'Y28'</span>, <span style="color: #c3e88d;">'Y29'</span>, <span style="color: #c3e88d;">'Y3'</span>, <span style="color: #c3e88d;">'Y30'</span>, <span style="color: #c3e88d;">'Y31'</span>,
       <span style="color: #c3e88d;">'Y32'</span>, <span style="color: #c3e88d;">'Y33'</span>, <span style="color: #c3e88d;">'Y34'</span>, <span style="color: #c3e88d;">'Y35'</span>, <span style="color: #c3e88d;">'Y36'</span>, <span style="color: #c3e88d;">'Y37'</span>, <span style="color: #c3e88d;">'Y38'</span>, <span style="color: #c3e88d;">'Y39'</span>, <span style="color: #c3e88d;">'Y4'</span>,
       <span style="color: #c3e88d;">'Y40'</span>, <span style="color: #c3e88d;">'Y41'</span>, <span style="color: #c3e88d;">'Y42'</span>, <span style="color: #c3e88d;">'Y43'</span>, <span style="color: #c3e88d;">'Y44'</span>, <span style="color: #c3e88d;">'Y45'</span>, <span style="color: #c3e88d;">'Y46'</span>, <span style="color: #c3e88d;">'Y47'</span>, <span style="color: #c3e88d;">'Y48'</span>,
       <span style="color: #c3e88d;">'Y49'</span>, <span style="color: #c3e88d;">'Y5'</span>, <span style="color: #c3e88d;">'Y50'</span>, <span style="color: #c3e88d;">'Y51'</span>, <span style="color: #c3e88d;">'Y52'</span>, <span style="color: #c3e88d;">'Y53'</span>, <span style="color: #c3e88d;">'Y54'</span>, <span style="color: #c3e88d;">'Y55'</span>, <span style="color: #c3e88d;">'Y56'</span>,
       <span style="color: #c3e88d;">'Y57'</span>, <span style="color: #c3e88d;">'Y58'</span>, <span style="color: #c3e88d;">'Y59'</span>, <span style="color: #c3e88d;">'Y6'</span>, <span style="color: #c3e88d;">'Y60'</span>, <span style="color: #c3e88d;">'Y61'</span>, <span style="color: #c3e88d;">'Y62'</span>, <span style="color: #c3e88d;">'Y63'</span>, <span style="color: #c3e88d;">'Y64'</span>,
       <span style="color: #c3e88d;">'Y65'</span>, <span style="color: #c3e88d;">'Y66'</span>, <span style="color: #c3e88d;">'Y67'</span>, <span style="color: #c3e88d;">'Y68'</span>, <span style="color: #c3e88d;">'Y69'</span>, <span style="color: #c3e88d;">'Y7'</span>, <span style="color: #c3e88d;">'Y70'</span>, <span style="color: #c3e88d;">'Y71'</span>, <span style="color: #c3e88d;">'Y72'</span>,
       <span style="color: #c3e88d;">'Y73'</span>, <span style="color: #c3e88d;">'Y74'</span>, <span style="color: #c3e88d;">'Y75'</span>, <span style="color: #c3e88d;">'Y76'</span>, <span style="color: #c3e88d;">'Y77'</span>, <span style="color: #c3e88d;">'Y78'</span>, <span style="color: #c3e88d;">'Y79'</span>, <span style="color: #c3e88d;">'Y8'</span>, <span style="color: #c3e88d;">'Y80'</span>,
       <span style="color: #c3e88d;">'Y81'</span>, <span style="color: #c3e88d;">'Y82'</span>, <span style="color: #c3e88d;">'Y83'</span>, <span style="color: #c3e88d;">'Y84'</span>, <span style="color: #c3e88d;">'Y85'</span>, <span style="color: #c3e88d;">'Y86'</span>, <span style="color: #c3e88d;">'Y87'</span>, <span style="color: #c3e88d;">'Y88'</span>, <span style="color: #c3e88d;">'Y89'</span>,
       <span style="color: #c3e88d;">'Y9'</span>, <span style="color: #c3e88d;">'Y90'</span>, <span style="color: #c3e88d;">'Y91'</span>, <span style="color: #c3e88d;">'Y92'</span>, <span style="color: #c3e88d;">'Y93'</span>, <span style="color: #c3e88d;">'Y94'</span>, <span style="color: #c3e88d;">'Y95'</span>, <span style="color: #c3e88d;">'Y96'</span>, <span style="color: #c3e88d;">'Y97'</span>,
       <span style="color: #c3e88d;">'Y98'</span>, <span style="color: #c3e88d;">'Y99'</span>]
df[<span style="color: #c3e88d;">'country_code'</span>] = [x[:2] <span style="color: #89DDFF;">for</span> x <span style="color: #89DDFF;">in</span> df[<span style="color: #c3e88d;">'geo'</span>]]
df[<span style="color: #c3e88d;">'country'</span>] = df[<span style="color: #c3e88d;">'country_code'</span>].replace(eurostat_dictionary)
df = df[df.country.isin(EU_countries) &amp; (df.sex.isin([<span style="color: #c3e88d;">"M"</span>,<span style="color: #c3e88d;">"F"</span>])) &amp; (df.age.isin(age_range))]
df.drop([<span style="color: #c3e88d;">'country'</span>,<span style="color: #c3e88d;">'country_code'</span>],axis=1,inplace=<span style="color: #f78c6c;">True</span>)
df = pd.melt(df,id_vars=[<span style="color: #c3e88d;">'geo'</span>,<span style="color: #c3e88d;">'sex'</span>,<span style="color: #c3e88d;">'age'</span>],
                        value_vars=np.arange(1990,2021),
                        var_name=<span style="color: #c3e88d;">'year'</span>,value_name=<span style="color: #c3e88d;">'population'</span>)
df[<span style="color: #c3e88d;">'nuts'</span>] = [<span style="color: #82aaff;">len</span>(x)-2 <span style="color: #89DDFF;">for</span> x <span style="color: #89DDFF;">in</span> df.geo]
df = df.query(<span style="color: #c3e88d;">'nuts == 2'</span>)
df.drop(<span style="color: #c3e88d;">'nuts'</span>,inplace=<span style="color: #f78c6c;">True</span>, axis=1)
df.rename({<span style="color: #c3e88d;">'geo'</span>:<span style="color: #c3e88d;">'nuts2'</span>, <span style="color: #c3e88d;">'age'</span>:<span style="color: #c3e88d;">'age string'</span>},axis=1,inplace=<span style="color: #f78c6c;">True</span>)
df[<span style="color: #c3e88d;">'age'</span>] = [<span style="color: #82aaff;">float</span>(x.replace(<span style="color: #c3e88d;">'Y'</span>,<span style="color: #c3e88d;">''</span>)) <span style="color: #89DDFF;">for</span> x <span style="color: #89DDFF;">in</span> df[<span style="color: #c3e88d;">'age string'</span>]]
df.drop(<span style="color: #c3e88d;">'age string'</span>,inplace=<span style="color: #f78c6c;">True</span>, axis=1)

df.set_index([<span style="color: #c3e88d;">'nuts2'</span>,<span style="color: #c3e88d;">'year'</span>,<span style="color: #c3e88d;">'sex'</span>,<span style="color: #c3e88d;">'age'</span>],inplace=<span style="color: #f78c6c;">True</span>)

df.head()
</pre>
</div>

<pre class="example" id="org29ee484">
     unit sex age   geo     2020     2019     2018     2017     2016     2015  \
1021   NR   F  Y1    AT  42255.0  42850.0  43340.0  41498.0  40860.0  39284.0
1022   NR   F  Y1   AT1  18442.0  18677.0  19094.0  18108.0  17897.0  17148.0
1023   NR   F  Y1  AT11   1172.0   1158.0   1163.0   1142.0   1106.0   1096.0
1024   NR   F  Y1  AT12   7587.0   7623.0   7752.0   7367.0   7402.0   7148.0
1025   NR   F  Y1  AT13   9683.0   9896.0  10179.0   9599.0   9389.0   8904.0

      ...     1999     1998     1997     1996     1995     1994     1993  \
1021  ...  41388.0  43312.0  43299.0  45079.0  46320.0  46324.0  46573.0
1022  ...  16281.0  16937.0  17000.0  17574.0  18228.0  18038.0  18327.0
1023  ...   1219.0   1275.0   1311.0   1325.0   1422.0   1349.0   1372.0
1024  ...   7703.0   8088.0   8107.0   8459.0   8775.0   8556.0   8883.0
1025  ...   7359.0   7574.0   7582.0   7790.0   8031.0   8133.0   8072.0

         1992     1991     1990
1021  45035.0  43825.0  43094.0
1022  17499.0  17038.0  16623.0
1023   1436.0   1371.0   1345.0
1024   8412.0   8234.0   8038.0
1025   7651.0   7433.0   7240.0

[5 rows x 35 columns]
</pre>



<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">ds</span> = df.to_xarray()
ds.to_netcdf(<span style="color: #c3e88d;">"./data/population_nuts_2.nc"</span>)
ds
</pre>
</div>

<pre class="example">
&lt;xarray.Dataset&gt;
Dimensions:     (age: 99, nuts2: 299, sex: 2, year: 31)
Coordinates:
  * nuts2       (nuts2) object 'AT11' 'AT12' 'AT13' ... 'UKM8' 'UKM9' 'UKN0'
  * year        (year) int64 1990 1991 1992 1993 1994 ... 2017 2018 2019 2020
  * sex         (sex) object 'F' 'M'
  * age         (age) float64 1.0 2.0 3.0 4.0 5.0 ... 95.0 96.0 97.0 98.0 99.0
Data variables:
    population  (nuts2, year, sex, age) float64 1.345e+03 1.349e+03 ... nan nan
</pre>




<ul class="org-ul">
<li>deaths: <a href="https://ec.europa.eu/eurostat/databrowser/view/demo_r_magec/default/table?lang=en">https://ec.europa.eu/eurostat/databrowser/view/demo_r_magec/default/table?lang=en</a></li>
</ul>


<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">df</span> = eurostat.get_data_df(<span style="color: #c3e88d;">'demo_r_magec'</span>)
df.rename({<span style="color: #c3e88d;">'geo\\time'</span>:<span style="color: #c3e88d;">'geo'</span>},inplace=<span style="color: #f78c6c;">True</span>,axis=1)
age_range = [<span style="color: #c3e88d;">'Y1'</span>, <span style="color: #c3e88d;">'Y10'</span>, <span style="color: #c3e88d;">'Y11'</span>, <span style="color: #c3e88d;">'Y12'</span>, <span style="color: #c3e88d;">'Y13'</span>, <span style="color: #c3e88d;">'Y14'</span>, <span style="color: #c3e88d;">'Y15'</span>,
       <span style="color: #c3e88d;">'Y16'</span>, <span style="color: #c3e88d;">'Y17'</span>, <span style="color: #c3e88d;">'Y18'</span>, <span style="color: #c3e88d;">'Y19'</span>, <span style="color: #c3e88d;">'Y2'</span>, <span style="color: #c3e88d;">'Y20'</span>, <span style="color: #c3e88d;">'Y21'</span>, <span style="color: #c3e88d;">'Y22'</span>, <span style="color: #c3e88d;">'Y23'</span>,
       <span style="color: #c3e88d;">'Y24'</span>, <span style="color: #c3e88d;">'Y25'</span>, <span style="color: #c3e88d;">'Y26'</span>, <span style="color: #c3e88d;">'Y27'</span>, <span style="color: #c3e88d;">'Y28'</span>, <span style="color: #c3e88d;">'Y29'</span>, <span style="color: #c3e88d;">'Y3'</span>, <span style="color: #c3e88d;">'Y30'</span>, <span style="color: #c3e88d;">'Y31'</span>,
       <span style="color: #c3e88d;">'Y32'</span>, <span style="color: #c3e88d;">'Y33'</span>, <span style="color: #c3e88d;">'Y34'</span>, <span style="color: #c3e88d;">'Y35'</span>, <span style="color: #c3e88d;">'Y36'</span>, <span style="color: #c3e88d;">'Y37'</span>, <span style="color: #c3e88d;">'Y38'</span>, <span style="color: #c3e88d;">'Y39'</span>, <span style="color: #c3e88d;">'Y4'</span>,
       <span style="color: #c3e88d;">'Y40'</span>, <span style="color: #c3e88d;">'Y41'</span>, <span style="color: #c3e88d;">'Y42'</span>, <span style="color: #c3e88d;">'Y43'</span>, <span style="color: #c3e88d;">'Y44'</span>, <span style="color: #c3e88d;">'Y45'</span>, <span style="color: #c3e88d;">'Y46'</span>, <span style="color: #c3e88d;">'Y47'</span>, <span style="color: #c3e88d;">'Y48'</span>,
       <span style="color: #c3e88d;">'Y49'</span>, <span style="color: #c3e88d;">'Y5'</span>, <span style="color: #c3e88d;">'Y50'</span>, <span style="color: #c3e88d;">'Y51'</span>, <span style="color: #c3e88d;">'Y52'</span>, <span style="color: #c3e88d;">'Y53'</span>, <span style="color: #c3e88d;">'Y54'</span>, <span style="color: #c3e88d;">'Y55'</span>, <span style="color: #c3e88d;">'Y56'</span>,
       <span style="color: #c3e88d;">'Y57'</span>, <span style="color: #c3e88d;">'Y58'</span>, <span style="color: #c3e88d;">'Y59'</span>, <span style="color: #c3e88d;">'Y6'</span>, <span style="color: #c3e88d;">'Y60'</span>, <span style="color: #c3e88d;">'Y61'</span>, <span style="color: #c3e88d;">'Y62'</span>, <span style="color: #c3e88d;">'Y63'</span>, <span style="color: #c3e88d;">'Y64'</span>,
       <span style="color: #c3e88d;">'Y65'</span>, <span style="color: #c3e88d;">'Y66'</span>, <span style="color: #c3e88d;">'Y67'</span>, <span style="color: #c3e88d;">'Y68'</span>, <span style="color: #c3e88d;">'Y69'</span>, <span style="color: #c3e88d;">'Y7'</span>, <span style="color: #c3e88d;">'Y70'</span>, <span style="color: #c3e88d;">'Y71'</span>, <span style="color: #c3e88d;">'Y72'</span>,
       <span style="color: #c3e88d;">'Y73'</span>, <span style="color: #c3e88d;">'Y74'</span>, <span style="color: #c3e88d;">'Y75'</span>, <span style="color: #c3e88d;">'Y76'</span>, <span style="color: #c3e88d;">'Y77'</span>, <span style="color: #c3e88d;">'Y78'</span>, <span style="color: #c3e88d;">'Y79'</span>, <span style="color: #c3e88d;">'Y8'</span>, <span style="color: #c3e88d;">'Y80'</span>,
       <span style="color: #c3e88d;">'Y81'</span>, <span style="color: #c3e88d;">'Y82'</span>, <span style="color: #c3e88d;">'Y83'</span>, <span style="color: #c3e88d;">'Y84'</span>, <span style="color: #c3e88d;">'Y85'</span>, <span style="color: #c3e88d;">'Y86'</span>, <span style="color: #c3e88d;">'Y87'</span>, <span style="color: #c3e88d;">'Y88'</span>, <span style="color: #c3e88d;">'Y89'</span>,
       <span style="color: #c3e88d;">'Y9'</span>, <span style="color: #c3e88d;">'Y90'</span>, <span style="color: #c3e88d;">'Y91'</span>, <span style="color: #c3e88d;">'Y92'</span>, <span style="color: #c3e88d;">'Y93'</span>, <span style="color: #c3e88d;">'Y94'</span>, <span style="color: #c3e88d;">'Y95'</span>, <span style="color: #c3e88d;">'Y96'</span>, <span style="color: #c3e88d;">'Y97'</span>,
       <span style="color: #c3e88d;">'Y98'</span>, <span style="color: #c3e88d;">'Y99'</span>]
df[<span style="color: #c3e88d;">'country_code'</span>] = [x[:2] <span style="color: #89DDFF;">for</span> x <span style="color: #89DDFF;">in</span> df[<span style="color: #c3e88d;">'geo'</span>]]
df[<span style="color: #c3e88d;">'country'</span>] = df[<span style="color: #c3e88d;">'country_code'</span>].replace(eurostat_dictionary)
df = df[df.country.isin(EU_countries) &amp; (df.sex.isin([<span style="color: #c3e88d;">"M"</span>,<span style="color: #c3e88d;">"F"</span>])) &amp; (df.age.isin(age_range))]
df.drop([<span style="color: #c3e88d;">'country'</span>,<span style="color: #c3e88d;">'country_code'</span>],axis=1,inplace=<span style="color: #f78c6c;">True</span>)
df = pd.melt(df,id_vars=[<span style="color: #c3e88d;">'geo'</span>,<span style="color: #c3e88d;">'sex'</span>,<span style="color: #c3e88d;">'age'</span>],
                        value_vars=np.arange(1990,2020),
                        var_name=<span style="color: #c3e88d;">'year'</span>,value_name=<span style="color: #c3e88d;">'deaths'</span>)
df[<span style="color: #c3e88d;">'nuts'</span>] = [<span style="color: #82aaff;">len</span>(x)-2 <span style="color: #89DDFF;">for</span> x <span style="color: #89DDFF;">in</span> df.geo]
df = df.query(<span style="color: #c3e88d;">'nuts == 2'</span>)
df.drop(<span style="color: #c3e88d;">'nuts'</span>,inplace=<span style="color: #f78c6c;">True</span>, axis=1)
df.rename({<span style="color: #c3e88d;">'geo'</span>:<span style="color: #c3e88d;">'nuts2'</span>, <span style="color: #c3e88d;">'age'</span>:<span style="color: #c3e88d;">'age string'</span>},axis=1,inplace=<span style="color: #f78c6c;">True</span>)
df[<span style="color: #c3e88d;">'age'</span>] = [<span style="color: #82aaff;">float</span>(x.replace(<span style="color: #c3e88d;">'Y'</span>,<span style="color: #c3e88d;">''</span>)) <span style="color: #89DDFF;">for</span> x <span style="color: #89DDFF;">in</span> df[<span style="color: #c3e88d;">'age string'</span>]]
df.drop(<span style="color: #c3e88d;">'age string'</span>,inplace=<span style="color: #f78c6c;">True</span>, axis=1)

df.set_index([<span style="color: #c3e88d;">'nuts2'</span>,<span style="color: #c3e88d;">'year'</span>,<span style="color: #c3e88d;">'sex'</span>,<span style="color: #c3e88d;">'age'</span>],inplace=<span style="color: #f78c6c;">True</span>)

df.head()
</pre>
</div>

<pre class="example" id="org9adbcbd">
     unit sex age   geo  2019  2018  2017  2016  2015  2014  ...  1999  1998  \
1021   NR   F  Y1    AT  11.0   9.0   7.0  11.0   7.0   6.0  ...  14.0  16.0
1022   NR   F  Y1   AT1   2.0   6.0   2.0   3.0   4.0   4.0  ...   3.0   8.0
1023   NR   F  Y1  AT11   0.0   2.0   0.0   0.0   0.0   0.0  ...   0.0   0.0
1024   NR   F  Y1  AT12   2.0   1.0   1.0   1.0   1.0   2.0  ...   2.0   5.0
1025   NR   F  Y1  AT13   0.0   3.0   1.0   2.0   3.0   2.0  ...   1.0   3.0

      1997  1996  1995  1994  1993  1992  1991  1990
1021  17.0  15.0  16.0  23.0  30.0  26.0  23.0  29.0
1022   4.0   4.0   NaN  13.0  12.0  11.0   7.0  11.0
1023   0.0   0.0   NaN   1.0   0.0   1.0   0.0   0.0
1024   3.0   1.0   NaN   5.0   3.0   5.0   1.0   7.0
1025   1.0   3.0   NaN   7.0   9.0   5.0   6.0   4.0

[5 rows x 34 columns]
</pre>



<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">ds</span> = df.to_xarray()
ds.to_netcdf(<span style="color: #c3e88d;">"./data/deaths_nuts_2.nc"</span>)
ds
</pre>
</div>

<pre class="example">
&lt;xarray.Dataset&gt;
Dimensions:  (age: 99, nuts2: 299, sex: 2, year: 30)
Coordinates:
  * nuts2    (nuts2) object 'AT11' 'AT12' 'AT13' 'AT21' ... 'UKM8' 'UKM9' 'UKN0'
  * year     (year) int64 1990 1991 1992 1993 1994 ... 2015 2016 2017 2018 2019
  * sex      (sex) object 'F' 'M'
  * age      (age) float64 1.0 2.0 3.0 4.0 5.0 6.0 ... 95.0 96.0 97.0 98.0 99.0
Data variables:
    deaths   (nuts2, year, sex, age) float64 0.0 0.0 1.0 1.0 ... nan nan nan nan
</pre>
</div>
</div>
