getting_data.org
*** mortality lagged per age

- useful link to lag variables in a pandas dataframe: https://stackoverflow.com/questions/61234837/pandas-panel-data-shifting-values-by-two-taking-into-consideration-year-gaps

#+begin_src jupyter-python :display plain

ds_population = xr.open_dataset('./data/population_nuts_2.nc')
ds_deaths =  xr.open_dataset('./data/deaths_nuts_2.nc')

ds_mortality = xr.merge([ds_population, ds_deaths])
ds_mortality
#+end_src

#+RESULTS:
: <xarray.Dataset>
: Dimensions:     (age: 99, nuts2: 299, sex: 2, year: 31)
: Coordinates:
:   * year        (year) int64 1990 1991 1992 1993 1994 ... 2017 2018 2019 2020
:   * nuts2       (nuts2) object 'AT11' 'AT12' 'AT13' ... 'UKM8' 'UKM9' 'UKN0'
:   * sex         (sex) object 'F' 'M'
:   * age         (age) float64 1.0 2.0 3.0 4.0 5.0 ... 95.0 96.0 97.0 98.0 99.0
: Data variables:
:     population  (nuts2, year, sex, age) float64 ...
:     deaths      (nuts2, year, sex, age) float64 0.0 0.0 1.0 1.0 ... nan nan nan




#+begin_src jupyter-python
df_mortality = ds_mortality.to_dataframe()
df_mortality = df_mortality[(df_mortality.population >= df_mortality.deaths) & (df_mortality.population > 0)] # drop rows where deaths > population at Jan. 1st (e.g. because people moved in the year)
df_mortality['mortality'] = df_mortality['deaths']/df_mortality['population']
df_mortality.reset_index(inplace=True)
df_mortality.rename({'level_3':'year'},inplace=True,axis=1)
df_mortality['year'] = pd.to_datetime(df_mortality['year'],format='%Y')
df_mortality.head()
#+end_src

#+RESULTS:
:    age nuts2 sex       year  population  deaths  mortality
: 0  1.0  AT11   F 1990-01-01      1345.0     0.0   0.000000
: 1  1.0  AT11   F 1991-01-01      1371.0     0.0   0.000000
: 2  1.0  AT11   F 1992-01-01      1436.0     1.0   0.000696
: 3  1.0  AT11   F 1993-01-01      1372.0     0.0   0.000000
: 4  1.0  AT11   F 1994-01-01      1349.0     1.0   0.000741

#+begin_src jupyter-python
new_column = (df_mortality.set_index(['year','age','nuts2','sex']).groupby(['age','nuts2','sex'])['mortality']
                .shift(1)).to_frame()
new_column.reset_index(inplace=True)
new_column.age += 1
new_column['year'] = new_column['year'].dt.year
new_column.rename({'mortality':'lagged_mortality'},inplace=True,axis=1)
##log_odds???
new_column.set_index(['year','age','nuts2','sex'],inplace=True)
new_column.head()
#+end_src

#+RESULTS:
:                     lagged_mortality
: year age nuts2 sex
: 1990 2.0 AT11  F                 NaN
: 1991 2.0 AT11  F            0.000000
: 1992 2.0 AT11  F            0.000000
: 1993 2.0 AT11  F            0.000696
: 1994 2.0 AT11  F            0.000000

#+begin_src jupyter-python :display plain
ds = new_column.to_xarray()
ds.to_netcdf("./data/lagged_mortality_nuts_2.nc")
ds
#+end_src

#+RESULTS:
: <xarray.Dataset>
: Dimensions:           (age: 99, nuts2: 297, sex: 2, year: 30)
: Coordinates:
:   * year              (year) int64 1990 1991 1992 1993 ... 2016 2017 2018 2019
:   * age               (age) float64 2.0 3.0 4.0 5.0 6.0 ... 97.0 98.0 99.0 100.0
:   * nuts2             (nuts2) object 'AT11' 'AT12' 'AT13' ... 'UKM9' 'UKN0'
:   * sex               (sex) object 'F' 'M'
: Data variables:
:     lagged_mortality  (year, age, nuts2, sex) float64 nan nan nan ... nan nan



*** Poverty measures


**** Severe material deprivation rate by NUTS 2 regions [TGS00104]

- link to the data: https://ec.europa.eu/eurostat/databrowser/view/tgs00104/default/table?lang=en

#+begin_src jupyter-python :display plain
df = eurostat.get_data_df('tgs00104')
df.rename({'geo\\time':'nuts2'},inplace=True,axis=1)
df = df[(df.unit == "PC")]
df.drop(["unit"],axis=1,inplace=True)
df['nuts'] = [len(x)-2 for x in df.nuts2]
df = df[df.nuts == 2]
df.drop('nuts',axis=1,inplace=True)

df = pd.melt(df,id_vars=['nuts2'],
                        value_vars=np.arange(2009,2021),
                        var_name='year',value_name='percentage_material_deprivation')
df.set_index(['nuts2','year'],inplace=True)
df.head()

#+end_src

#+RESULTS:
#+begin_example
  nuts2  2009  2010  2011  2012  2013  2014  2015  2016  2017  2018  2019  \
0  AL01   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  46.5  38.6  38.5
1  AL02   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  41.0  40.4  37.7
2  AL03   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  36.4  35.3  34.9
3  AT11   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
4  AT12   NaN   NaN   NaN   NaN   NaN   2.7   2.1   2.2   1.9   2.1   NaN

   2020
0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
#+end_example


#+begin_src jupyter-python
ds_material_deprivation = df.to_xarray()
ds_material_deprivation.to_netcdf("./data/material_deprivation_nuts_2.nc")
ds_material_deprivation
#+end_src

#+RESULTS:
: <xarray.Dataset>
: Dimensions:                          (nuts2: 179, year: 12)
: Coordinates:
:   * nuts2                            (nuts2) object 'AL01' 'AL02' ... 'SK04'
:   * year                             (year) int64 2009 2010 2011 ... 2019 2020
: Data variables:
:     percentage_material_deprivation  (nuts2, year) float64 nan nan ... 9.6 8.3

