getting_data.html


<div id="outline-container-org963d7f9" class="outline-4">
<h4 id="org963d7f9"><span class="section-number-4">4.2.2.</span> mortality lagged per age</h4>
<div class="outline-text-4" id="text-4-2-2">
<ul class="org-ul">
<li>useful link to lag variables in a pandas dataframe: <a href="https://stackoverflow.com/questions/61234837/pandas-panel-data-shifting-values-by-two-taking-into-consideration-year-gaps">https://stackoverflow.com/questions/61234837/pandas-panel-data-shifting-values-by-two-taking-into-consideration-year-gaps</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-jupyter-python">
<span style="color: #ffcb6b;">ds_population</span> = xr.open_dataset(<span style="color: #c3e88d;">'./data/population_nuts_2.nc'</span>)
<span style="color: #ffcb6b;">ds_deaths</span> =  xr.open_dataset(<span style="color: #c3e88d;">'./data/deaths_nuts_2.nc'</span>)

<span style="color: #ffcb6b;">ds_mortality</span> = xr.merge([ds_population, ds_deaths])
ds_mortality
</pre>
</div>

<pre class="example">
&lt;xarray.Dataset&gt;
Dimensions:     (age: 99, nuts2: 299, sex: 2, year: 31)
Coordinates:
  * year        (year) int64 1990 1991 1992 1993 1994 ... 2017 2018 2019 2020
  * nuts2       (nuts2) object 'AT11' 'AT12' 'AT13' ... 'UKM8' 'UKM9' 'UKN0'
  * sex         (sex) object 'F' 'M'
  * age         (age) float64 1.0 2.0 3.0 4.0 5.0 ... 95.0 96.0 97.0 98.0 99.0
Data variables:
    population  (nuts2, year, sex, age) float64 ...
    deaths      (nuts2, year, sex, age) float64 0.0 0.0 1.0 1.0 ... nan nan nan
</pre>





<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">df_mortality</span> = ds_mortality.to_dataframe()
<span style="color: #ffcb6b;">df_mortality</span> = df_mortality[(df_mortality.population &gt;= df_mortality.deaths) &amp; (df_mortality.population &gt; 0)] <span style="color: #676E95;"># </span><span style="color: #676E95;">drop rows where deaths &gt; population at Jan. 1st (e.g. because people moved in the year)</span>
<span style="color: #ffcb6b;">df_mortality</span>[<span style="color: #c3e88d;">'mortality'</span>] = df_mortality[<span style="color: #c3e88d;">'deaths'</span>]/df_mortality[<span style="color: #c3e88d;">'population'</span>]
df_mortality.reset_index(inplace=<span style="color: #f78c6c;">True</span>)
df_mortality.rename({<span style="color: #c3e88d;">'level_3'</span>:<span style="color: #c3e88d;">'year'</span>},inplace=<span style="color: #f78c6c;">True</span>,axis=1)
df_mortality[<span style="color: #c3e88d;">'year'</span>] = pd.to_datetime(df_mortality[<span style="color: #c3e88d;">'year'</span>],<span style="color: #82aaff;">format</span>=<span style="color: #c3e88d;">'%Y'</span>)
df_mortality.head()
</pre>
</div>

<pre class="example">
   age nuts2 sex       year  population  deaths  mortality
0  1.0  AT11   F 1990-01-01      1345.0     0.0   0.000000
1  1.0  AT11   F 1991-01-01      1371.0     0.0   0.000000
2  1.0  AT11   F 1992-01-01      1436.0     1.0   0.000696
3  1.0  AT11   F 1993-01-01      1372.0     0.0   0.000000
4  1.0  AT11   F 1994-01-01      1349.0     1.0   0.000741
</pre>


<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">new_column</span> = (df_mortality.set_index([<span style="color: #c3e88d;">'year'</span>,<span style="color: #c3e88d;">'age'</span>,<span style="color: #c3e88d;">'nuts2'</span>,<span style="color: #c3e88d;">'sex'</span>]).groupby([<span style="color: #c3e88d;">'age'</span>,<span style="color: #c3e88d;">'nuts2'</span>,<span style="color: #c3e88d;">'sex'</span>])[<span style="color: #c3e88d;">'mortality'</span>]
                .shift(1)).to_frame()
new_column.reset_index(inplace=<span style="color: #f78c6c;">True</span>)
new_column.age += 1
new_column[<span style="color: #c3e88d;">'year'</span>] = new_column[<span style="color: #c3e88d;">'year'</span>].dt.year
new_column.rename({<span style="color: #c3e88d;">'mortality'</span>:<span style="color: #c3e88d;">'lagged_mortality'</span>},inplace=<span style="color: #f78c6c;">True</span>,axis=1)
<span style="color: #676E95;">##</span><span style="color: #676E95;">log_odds???</span>
new_column.set_index([<span style="color: #c3e88d;">'year'</span>,<span style="color: #c3e88d;">'age'</span>,<span style="color: #c3e88d;">'nuts2'</span>,<span style="color: #c3e88d;">'sex'</span>],inplace=<span style="color: #f78c6c;">True</span>)
new_column.head()
</pre>
</div>

<pre class="example">
                    lagged_mortality
year age nuts2 sex
1990 2.0 AT11  F                 NaN
1991 2.0 AT11  F            0.000000
1992 2.0 AT11  F            0.000000
1993 2.0 AT11  F            0.000696
1994 2.0 AT11  F            0.000000
</pre>


<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">ds</span> = new_column.to_xarray()
ds.to_netcdf(<span style="color: #c3e88d;">"./data/lagged_mortality_nuts_2.nc"</span>)
ds
</pre>
</div>

<pre class="example">
&lt;xarray.Dataset&gt;
Dimensions:           (age: 99, nuts2: 297, sex: 2, year: 30)
Coordinates:
  * year              (year) int64 1990 1991 1992 1993 ... 2016 2017 2018 2019
  * age               (age) float64 2.0 3.0 4.0 5.0 6.0 ... 97.0 98.0 99.0 100.0
  * nuts2             (nuts2) object 'AT11' 'AT12' 'AT13' ... 'UKM9' 'UKN0'
  * sex               (sex) object 'F' 'M'
Data variables:
    lagged_mortality  (year, age, nuts2, sex) float64 nan nan nan ... nan nan
</pre>
</div>
</div>



<div id="outline-container-orgf012b98" class="outline-4">
<h4 id="orgf012b98"><span class="section-number-4">4.2.3.</span> Poverty measures</h4>
<div class="outline-text-4" id="text-4-2-3">
</div>
<ol class="org-ol">
<li><a id="org0f4c451"></a>Severe material deprivation rate by NUTS 2 regions [TGS00104]<br />
<div class="outline-text-5" id="text-4-2-3-1">
<ul class="org-ul">
<li>link to the data: <a href="https://ec.europa.eu/eurostat/databrowser/view/tgs00104/default/table?lang=en">https://ec.europa.eu/eurostat/databrowser/view/tgs00104/default/table?lang=en</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">df</span> = eurostat.get_data_df(<span style="color: #c3e88d;">'tgs00104'</span>)
df.rename({<span style="color: #c3e88d;">'geo\\time'</span>:<span style="color: #c3e88d;">'nuts2'</span>},inplace=<span style="color: #f78c6c;">True</span>,axis=1)
df = df[(df.unit == <span style="color: #c3e88d;">"PC"</span>)]
df.drop([<span style="color: #c3e88d;">"unit"</span>],axis=1,inplace=<span style="color: #f78c6c;">True</span>)
df[<span style="color: #c3e88d;">'nuts'</span>] = [<span style="color: #82aaff;">len</span>(x)-2 <span style="color: #89DDFF;">for</span> x <span style="color: #89DDFF;">in</span> df.nuts2]
df = df[df.nuts == 2]
df.drop(<span style="color: #c3e88d;">'nuts'</span>,axis=1,inplace=<span style="color: #f78c6c;">True</span>)

df = pd.melt(df,id_vars=[<span style="color: #c3e88d;">'nuts2'</span>],
                        value_vars=np.arange(2009,2021),
                        var_name=<span style="color: #c3e88d;">'year'</span>,value_name=<span style="color: #c3e88d;">'percentage_material_deprivation'</span>)
df.set_index([<span style="color: #c3e88d;">'nuts2'</span>,<span style="color: #c3e88d;">'year'</span>],inplace=<span style="color: #f78c6c;">True</span>)
df.head()

</pre>
</div>

<pre class="example" id="org14fe0a7">
  nuts2  2009  2010  2011  2012  2013  2014  2015  2016  2017  2018  2019  \
0  AL01   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  46.5  38.6  38.5
1  AL02   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  41.0  40.4  37.7
2  AL03   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  36.4  35.3  34.9
3  AT11   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
4  AT12   NaN   NaN   NaN   NaN   NaN   2.7   2.1   2.2   1.9   2.1   NaN

   2020
0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
</pre>


<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">ds_material_deprivation</span> = df.to_xarray()
ds_material_deprivation.to_netcdf(<span style="color: #c3e88d;">"./data/material_deprivation_nuts_2.nc"</span>)
ds_material_deprivation
</pre>
</div>

<pre class="example">
&lt;xarray.Dataset&gt;
Dimensions:                          (nuts2: 179, year: 12)
Coordinates:
  * nuts2                            (nuts2) object 'AL01' 'AL02' ... 'SK04'
  * year                             (year) int64 2009 2010 2011 ... 2019 2020
Data variables:
    percentage_material_deprivation  (nuts2, year) float64 nan nan ... 9.6 8.3
</pre>
</div>
</li>
