getting_data.org
**** At-risk-of-poverty rate by NUTS 2 regions [TGS00103]

- link to the data: https://ec.europa.eu/eurostat/databrowser/view/tgs00103/default/table?lang=en


#+begin_src jupyter-python :display plain
df = eurostat.get_data_df('tgs00103')
df.rename({'geo\\time':'nuts2'},inplace=True,axis=1)
df = df[(df.unit == "PC_POP")]
df.drop(["unit"],axis=1,inplace=True)
df['nuts'] = [len(x)-2 for x in df.nuts2]
df = df[df.nuts == 2]
df.drop('nuts',axis=1,inplace=True)

df = pd.melt(df,id_vars=['nuts2'],
                        value_vars=np.arange(2009,2021),
                        var_name='year',value_name='at risk of poverty')
df.set_index(['nuts2','year'],inplace=True)
df.head()

#+end_src

#+RESULTS:
#+begin_example
  nuts2  2009  2010  2011  2012  2013  2014  2015  2016  2017  2018  2019  \
0  AL01   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  25.6  25.1  25.9
1  AL02   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  20.8  23.6  22.7
2  AL03   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  25.6  21.6  20.8
3  BG31  32.9  30.5  31.4  29.4  27.4  27.0  30.4  32.1  32.8  35.1  31.7
4  BG32  27.8  28.8  28.0  23.6  17.9  21.2  19.3  24.0  24.0  20.8  23.7

   2020
0   NaN
1   NaN
2   NaN
3  34.9
4  24.0
#+end_example


#+begin_src jupyter-python
ds_at_risk_of_poverty = df.to_xarray()
ds_at_risk_of_poverty.to_netcdf("./data/at_risk_of_poverty_nuts_2.nc")
ds_at_risk_of_poverty
#+end_src

#+RESULTS:
: <xarray.Dataset>
: Dimensions:             (nuts2: 170, year: 12)
: Coordinates:
:   * nuts2               (nuts2) object 'AL01' 'AL02' 'AL03' ... 'SK03' 'SK04'
:   * year                (year) int64 2009 2010 2011 2012 ... 2017 2018 2019 2020
: Data variables:
:     at risk of poverty  (nuts2, year) float64 nan nan nan nan ... 17.1 17.0 16.5

*** unmet needs

Self-reported unmet needs for medical examination by main reason declared and NUTS 2 regions

- link to the data: https://ec.europa.eu/eurostat/databrowser/view/hlth_silc_08_r/default/table?lang=en

| value    |                                                         |
|----------+---------------------------------------------------------|
| TOOEXP   | Too expensive                                           |
| TOOFAR   | Too far to travel                                       |
| TOOEFW   | Too expensive or too far to travel or waiting list      |
| NOTIME   | No time                                                 |
| NO_UNMET | No unmet needs to declare                               |
| NOKNOW   | Didn't know any good doctor or specialist               |
| WAITING  | Waiting list                                            |
| FEAR     | Fear of doctor, hospital, examination or treatment      |
| HOPING   | Wanted to wait and see if problem got better on its own |
| OTH      | Other                                                   |

#+begin_src jupyter-python :display plain
df = eurostat.get_data_df('hlth_silc_08_r')
df.rename({'geo\\time':'nuts2'},inplace=True,axis=1)
df.drop(["unit"],axis=1,inplace=True)
df['nuts'] = [len(x)-2 for x in df.nuts2]
df = df[df.nuts == 2]
df.drop('nuts',axis=1,inplace=True)
df=df[df.reason.isin(['FEAR','TOOEXP','TOOFAR','WAITING','HOPING', 'NOTIME', 'NO_UNMET','NOKNOW', 'OTH'])]
df = pd.melt(df,id_vars=['nuts2','reason'],
                        value_vars=np.arange(2009,2021),
                        var_name='year',value_name='unmet needs')
df.set_index(['nuts2','year','reason'],inplace=True)

df = df.unstack()
df.columns = df.columns.droplevel()
df.tail()

#+end_src

#+RESULTS:
#+begin_example
reason      FEAR  HOPING  NOKNOW  NOTIME  NO_UNMET  OTH  TOOEXP  TOOFAR  \
nuts2 year                                                                
SK04  2016   0.5     2.4     0.4     1.6      91.9  0.7     0.5     0.2   
      2017   0.2     1.3     0.5     1.4      94.1  0.4     0.2     0.3   
      2018   0.6     1.7     0.5     1.2      93.7  0.3     0.4     0.1   
      2019   0.6     1.5     0.4     1.7      93.1  0.3     0.4     0.1   
      2020   0.8     1.2     0.7     1.2      92.4  1.5     0.2     0.1   

reason      WAITING  
nuts2 year           
SK04  2016      1.8  
      2017      1.6  
      2018      1.7  
      2019      1.9  
      2020      1.8  
#+end_example


#+begin_src jupyter-python
ds_unmet_needs = df.to_xarray()
ds_unmet_needs.to_netcdf("./data/unmet_needs_nuts_2.nc")
ds_unmet_needs
#+end_src

#+RESULTS:
#+begin_example
<xarray.Dataset>
Dimensions:  (nuts2: 103, year: 12)
Coordinates:
  ,* nuts2    (nuts2) object 'AL01' 'AL02' 'AL03' 'BG31' ... 'SK02' 'SK03' 'SK04'
  ,* year     (year) int64 2009 2010 2011 2012 2013 ... 2016 2017 2018 2019 2020
Data variables:
    FEAR     (nuts2, year) float64 nan nan nan nan nan ... 0.5 0.2 0.6 0.6 0.8
    HOPING   (nuts2, year) float64 nan nan nan nan nan ... 2.4 1.3 1.7 1.5 1.2
    TOOEXP   (nuts2, year) float64 nan nan nan nan nan ... 0.5 0.2 0.4 0.4 0.2
    TOOFAR   (nuts2, year) float64 nan nan nan nan nan ... 0.2 0.3 0.1 0.1 0.1
    WAITING  (nuts2, year) float64 nan nan nan nan nan ... 1.8 1.6 1.7 1.9 1.8
#+end_example


