getting_data.html

<li><a id="orgeee84bb"></a>At-risk-of-poverty rate by NUTS 2 regions [TGS00103]<br />
<div class="outline-text-5" id="text-4-2-3-2">
<ul class="org-ul">
<li>link to the data: <a href="https://ec.europa.eu/eurostat/databrowser/view/tgs00103/default/table?lang=en">https://ec.europa.eu/eurostat/databrowser/view/tgs00103/default/table?lang=en</a></li>
</ul>


<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">df</span> = eurostat.get_data_df(<span style="color: #c3e88d;">'tgs00103'</span>)
df.rename({<span style="color: #c3e88d;">'geo\\time'</span>:<span style="color: #c3e88d;">'nuts2'</span>},inplace=<span style="color: #f78c6c;">True</span>,axis=1)
df = df[(df.unit == <span style="color: #c3e88d;">"PC_POP"</span>)]
df.drop([<span style="color: #c3e88d;">"unit"</span>],axis=1,inplace=<span style="color: #f78c6c;">True</span>)
df[<span style="color: #c3e88d;">'nuts'</span>] = [<span style="color: #82aaff;">len</span>(x)-2 <span style="color: #89DDFF;">for</span> x <span style="color: #89DDFF;">in</span> df.nuts2]
df = df[df.nuts == 2]
df.drop(<span style="color: #c3e88d;">'nuts'</span>,axis=1,inplace=<span style="color: #f78c6c;">True</span>)

df = pd.melt(df,id_vars=[<span style="color: #c3e88d;">'nuts2'</span>],
                        value_vars=np.arange(2009,2021),
                        var_name=<span style="color: #c3e88d;">'year'</span>,value_name=<span style="color: #c3e88d;">'at risk of poverty'</span>)
df.set_index([<span style="color: #c3e88d;">'nuts2'</span>,<span style="color: #c3e88d;">'year'</span>],inplace=<span style="color: #f78c6c;">True</span>)
df.head()

</pre>
</div>

<pre class="example" id="orgdc0da66">
  nuts2  2009  2010  2011  2012  2013  2014  2015  2016  2017  2018  2019  \
0  AL01   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  25.6  25.1  25.9
1  AL02   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  20.8  23.6  22.7
2  AL03   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  25.6  21.6  20.8
3  BG31  32.9  30.5  31.4  29.4  27.4  27.0  30.4  32.1  32.8  35.1  31.7
4  BG32  27.8  28.8  28.0  23.6  17.9  21.2  19.3  24.0  24.0  20.8  23.7

   2020
0   NaN
1   NaN
2   NaN
3  34.9
4  24.0
</pre>


<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">ds_at_risk_of_poverty</span> = df.to_xarray()
ds_at_risk_of_poverty.to_netcdf(<span style="color: #c3e88d;">"./data/at_risk_of_poverty_nuts_2.nc"</span>)
ds_at_risk_of_poverty
</pre>
</div>

<pre class="example">
&lt;xarray.Dataset&gt;
Dimensions:             (nuts2: 170, year: 12)
Coordinates:
  * nuts2               (nuts2) object 'AL01' 'AL02' 'AL03' ... 'SK03' 'SK04'
  * year                (year) int64 2009 2010 2011 2012 ... 2017 2018 2019 2020
Data variables:
    at risk of poverty  (nuts2, year) float64 nan nan nan nan ... 17.1 17.0 16.5
</pre>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgfd28082" class="outline-4">
<h4 id="orgfd28082"><span class="section-number-4">4.2.4.</span> unmet needs</h4>
<div class="outline-text-4" id="text-4-2-4">
<p>
Self-reported unmet needs for medical examination by main reason declared and NUTS 2 regions
</p>

<ul class="org-ul">
<li>link to the data: <a href="https://ec.europa.eu/eurostat/databrowser/view/hlth_silc_08_r/default/table?lang=en">https://ec.europa.eu/eurostat/databrowser/view/hlth_silc_08_r/default/table?lang=en</a></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">value</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">TOOEXP</td>
<td class="org-left">Too expensive</td>
</tr>

<tr>
<td class="org-left">TOOFAR</td>
<td class="org-left">Too far to travel</td>
</tr>

<tr>
<td class="org-left">TOOEFW</td>
<td class="org-left">Too expensive or too far to travel or waiting list</td>
</tr>

<tr>
<td class="org-left">NOTIME</td>
<td class="org-left">No time</td>
</tr>

<tr>
<td class="org-left">NO_UNMET</td>
<td class="org-left">No unmet needs to declare</td>
</tr>

<tr>
<td class="org-left">NOKNOW</td>
<td class="org-left">Didn't know any good doctor or specialist</td>
</tr>

<tr>
<td class="org-left">WAITING</td>
<td class="org-left">Waiting list</td>
</tr>

<tr>
<td class="org-left">FEAR</td>
<td class="org-left">Fear of doctor, hospital, examination or treatment</td>
</tr>

<tr>
<td class="org-left">HOPING</td>
<td class="org-left">Wanted to wait and see if problem got better on its own</td>
</tr>

<tr>
<td class="org-left">OTH</td>
<td class="org-left">Other</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">df</span> = eurostat.get_data_df(<span style="color: #c3e88d;">'hlth_silc_08_r'</span>)
df.rename({<span style="color: #c3e88d;">'geo\\time'</span>:<span style="color: #c3e88d;">'nuts2'</span>},inplace=<span style="color: #f78c6c;">True</span>,axis=1)
df.drop([<span style="color: #c3e88d;">"unit"</span>],axis=1,inplace=<span style="color: #f78c6c;">True</span>)
df[<span style="color: #c3e88d;">'nuts'</span>] = [<span style="color: #82aaff;">len</span>(x)-2 <span style="color: #89DDFF;">for</span> x <span style="color: #89DDFF;">in</span> df.nuts2]
df = df[df.nuts == 2]
df.drop(<span style="color: #c3e88d;">'nuts'</span>,axis=1,inplace=<span style="color: #f78c6c;">True</span>)
df=df[df.reason.isin([<span style="color: #c3e88d;">'FEAR'</span>,<span style="color: #c3e88d;">'TOOEXP'</span>,<span style="color: #c3e88d;">'TOOFAR'</span>,<span style="color: #c3e88d;">'WAITING'</span>,<span style="color: #c3e88d;">'HOPING'</span>])]
df = pd.melt(df,id_vars=[<span style="color: #c3e88d;">'nuts2'</span>,<span style="color: #c3e88d;">'reason'</span>],
                        value_vars=np.arange(2009,2021),
                        var_name=<span style="color: #c3e88d;">'year'</span>,value_name=<span style="color: #c3e88d;">'unmet needs'</span>)
df.set_index([<span style="color: #c3e88d;">'nuts2'</span>,<span style="color: #c3e88d;">'year'</span>,<span style="color: #c3e88d;">'reason'</span>],inplace=<span style="color: #f78c6c;">True</span>)

df = df.unstack()
df.columns = df.columns.droplevel()
df.tail()

</pre>
</div>

<pre class="example">
reason      FEAR  HOPING  TOOEXP  TOOFAR  WAITING
nuts2 year
SK04  2016   0.5     2.4     0.5     0.2      1.8
      2017   0.2     1.3     0.2     0.3      1.6
      2018   0.6     1.7     0.4     0.1      1.7
      2019   0.6     1.5     0.4     0.1      1.9
      2020   0.8     1.2     0.2     0.1      1.8
</pre>



<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #ffcb6b;">ds_unmet_needs</span> = df.to_xarray()
ds_unmet_needs.to_netcdf(<span style="color: #c3e88d;">"./data/unmet_needs_nuts_2.nc"</span>)
ds_unmet_needs
</pre>
</div>

<pre class="example" id="org889ef35">
&lt;xarray.Dataset&gt;
Dimensions:  (nuts2: 103, year: 12)
Coordinates:
  * nuts2    (nuts2) object 'AL01' 'AL02' 'AL03' 'BG31' ... 'SK02' 'SK03' 'SK04'
  * year     (year) int64 2009 2010 2011 2012 2013 ... 2016 2017 2018 2019 2020
Data variables:
    FEAR     (nuts2, year) float64 nan nan nan nan nan ... 0.5 0.2 0.6 0.6 0.8
    HOPING   (nuts2, year) float64 nan nan nan nan nan ... 2.4 1.3 1.7 1.5 1.2
    TOOEXP   (nuts2, year) float64 nan nan nan nan nan ... 0.5 0.2 0.4 0.4 0.2
    TOOFAR   (nuts2, year) float64 nan nan nan nan nan ... 0.2 0.3 0.1 0.1 0.1
    WAITING  (nuts2, year) float64 nan nan nan nan nan ... 1.8 1.6 1.7 1.9 1.8
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jan Boone</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
